![example](images/director_shot.jpeg)

# Phase 1 Project

**Authors:** Jonathan Holt
***

## Overview

A one-paragraph overview of the project, including the business problem, data, methods, results and recommendations.

## Business Problem

Summary of the business problem you are trying to solve, and the data questions that you plan to answer to solve them.

***
Questions to consider:
* What are the business's pain points related to this project?
* How did you pick the data analysis question(s) that you did?
* Why are these questions important from a business perspective?
***

## Data Understanding

Describe the data being used for this project.
***
Questions to consider:
* Where did the data come from, and how do they relate to the data analysis questions?
* What do the data represent? Who is in the sample and what variables are included?
* What is the target variable?
* What are the properties of the variables you intend to use?
***

In [1]:
# Import standard packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
# Here you run your code to explore the data
import glob, os
fpath = 'zippedData/'
os.listdir(fpath)

['imdb.title.crew.csv.gz',
 'tmdb.movies.csv.gz',
 'imdb.title.akas.csv.gz',
 'imdb.title.ratings.csv.gz',
 'imdb.name.basics.csv.gz',
 'rt.reviews.tsv.gz',
 'imdb.title.basics.csv.gz',
 'rt.movie_info.tsv.gz',
 'tn.movie_budgets.csv.gz',
 'bom.movie_gross.csv.gz',
 'imdb.title.principals.csv.gz']

In [3]:
query = fpath+"*.gz"

file_list=glob.glob(query)
file_list

['zippedData/imdb.title.crew.csv.gz',
 'zippedData/tmdb.movies.csv.gz',
 'zippedData/imdb.title.akas.csv.gz',
 'zippedData/imdb.title.ratings.csv.gz',
 'zippedData/imdb.name.basics.csv.gz',
 'zippedData/rt.reviews.tsv.gz',
 'zippedData/imdb.title.basics.csv.gz',
 'zippedData/rt.movie_info.tsv.gz',
 'zippedData/tn.movie_budgets.csv.gz',
 'zippedData/bom.movie_gross.csv.gz',
 'zippedData/imdb.title.principals.csv.gz']

In [4]:
tables = {}

for file in file_list:
    print('---'*20)
    file_name = file.replace('zippedData/', '').replace('.', '_')
    print(file_name)
    
    
    
    if 'tsv.gz' in file:
        temp_df = pd.read_csv(file, sep= "\t", encoding = "latin-1")
    else:
        temp_df = pd.read_csv(file)
    
    display(temp_df.head(), temp_df.tail())
    tables[file_name] = temp_df

------------------------------------------------------------
imdb_title_crew_csv_gz

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

           tconst              directors     writers
146139  tt8999974             nm10122357  nm10122357
146140  tt9001390              nm6711477   nm6711477
146141  tt9001494  nm10123242,nm10123248         NaN
146142  tt9004986              nm4993825   nm4993825
146143  tt9010172                    NaN   nm8352242

------------------------------------------------------------
tmdb_movies_csv_gz

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
26512,26512,"[27, 18]",488143,en,Laboratory Conditions,0.6,2018-10-13,Laboratory Conditions,0.0,1
26513,26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.6,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,26514,"[14, 28, 12]",381231,en,The Last One,0.6,2018-10-01,The Last One,0.0,1
26515,26515,"[10751, 12, 28]",366854,en,Trailer Made,0.6,2018-06-22,Trailer Made,0.0,1
26516,26516,"[53, 27]",309885,en,The Church,0.6,2018-10-05,The Church,0.0,1

------------------------------------------------------------
imdb_title_akas_csv_gz

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

,title_id,ordering,title,region,language,types,attributes,is_original_title
331698,tt9827784,2,Sayonara kuchibiru,NaN,NaN,original,NaN,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,NaN,0.0
331700,tt9880178,1,La atención,NaN,NaN,original,NaN,1.0
331701,tt9880178,2,La atención,ES,NaN,NaN,NaN,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,NaN,0.0

------------------------------------------------------------
imdb_title_ratings_csv_gz

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

          tconst  averagerating  numvotes
73851  tt9805820            8.1        25
73852  tt9844256            7.5        24
73853  tt9851050            4.7        14
73854  tt9886934            7.0         5
73855  tt9894098            6.3       128

------------------------------------------------------------
imdb_name_basics_csv_gz

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
606643,nm9990381,Susan Grobes,NaN,NaN,actress,NaN
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer,NaN
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182

------------------------------------------------------------
rt_reviews_tsv_gz

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

,id,review,rating,fresh,critic,top_critic,publisher,date
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

------------------------------------------------------------
imdb_title_basics_csv_gz

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

------------------------------------------------------------
rt_movie_info_tsv_gz

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
1555,1996,Forget terrorists or hijackers -- there's a ha...,R,Action and Adventure|Horror|Mystery and Suspense,NaN,NaN,"Aug 18, 2006","Jan 2, 2007",$,"33,886,034",106 minutes,New Line Cinema
1556,1997,The popular Saturday Night Live sketch was exp...,PG,Comedy|Science Fiction and Fantasy,Steve Barron,Terry Turner|Tom Davis|Dan Aykroyd|Bonnie Turner,"Jul 23, 1993","Apr 17, 2001",NaN,NaN,88 minutes,Paramount Vantage
1557,1998,"Based on a novel by Richard Powell, when the l...",G,Classics|Comedy|Drama|Musical and Performing Arts,Gordon Douglas,NaN,"Jan 1, 1962","May 11, 2004",NaN,NaN,111 minutes,NaN
1558,1999,The Sandlot is a coming-of-age story about a g...,PG,Comedy|Drama|Kids and Family|Sports and Fitness,David Mickey Evans,David Mickey Evans|Robert Gunter,"Apr 1, 1993","Jan 29, 2002",NaN,NaN,101 minutes,NaN
1559,2000,"Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,NaN,Luc Besson,"Sep 27, 2001","Feb 11, 2003",NaN,NaN,94 minutes,Columbia Pictures

------------------------------------------------------------
tn_movie_budgets_csv_gz

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

------------------------------------------------------------
bom_movie_gross_csv_gz

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

,title,studio,domestic_gross,foreign_gross,year
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

------------------------------------------------------------
imdb_title_principals_csv_gz

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

,tconst,ordering,nconst,category,job,characters
1028181,tt9692684,1,nm0186469,actor,NaN,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,NaN,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,NaN,NaN
1028184,tt9692684,4,nm6009913,writer,writer,NaN
1028185,tt9692684,5,nm10441595,producer,producer,NaN

In [5]:
#attempting to sort by the largest worldwide_gross

tables['tn_movie_budgets_csv_gz'].sort_values(by='worldwide_gross', ascending=False)

#something is wrong here. I assume that it is sorting anything with a '9' in the front first.
#I presume that the dollar amounts are strings instead of integers. I should also check for
#null values while I'm checking for this.

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
3737,38,"Aug 21, 2009",Fifty Dead Men Walking,"$10,000,000",$0,"$997,921"
3432,33,"Sep 30, 2005",Duma,"$12,000,000","$870,067","$994,790"
5062,63,"Apr 1, 2011",Insidious,"$1,500,000","$54,009,150","$99,870,886"
883,84,"Apr 2, 2004",Hellboy,"$60,000,000","$59,623,958","$99,823,958"
5613,14,"Mar 21, 1980",Mad Max,"$200,000","$8,750,000","$99,750,000"
...,...,...,...,...,...,...
5488,89,"Dec 31, 2014",The Sound and the Shadow,"$500,000",$0,$0
5487,88,"Dec 1, 2015",Brooklyn Bizarre,"$500,000",$0,$0
5486,87,"Aug 11, 2015",Alleluia! The Devil's Carnival,"$500,000",$0,$0
5485,86,"Jun 23, 2015",Crossroads,"$500,000",$0,$0
4765,66,"Jan 15, 2013",30 Nights Of Paranormal Activity With The Devi...,"$3,000,000",$0,$0

In [6]:
tables['tn_movie_budgets_csv_gz'].info()

#Sure enough, everything is a string except for the ID field. I will convert all of the financial information
#to integers, and while I'm at it. I will also convert the release date field to date/time.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [7]:
table9 = tables['tn_movie_budgets_csv_gz']
#Setting this table as 'table9' to make it easier to write. It is the ninth dataset out of the eleven given.

In [8]:
table9.isna().sum()
#there are no null values, but there are likely placeholders

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [9]:
cleaned_budget = table9['production_budget'].map(lambda x: x.replace('$',' '))
cleaned_budget

0        425,000,000
1        410,600,000
2        350,000,000
3        330,600,000
4        317,000,000
            ...
5777           7,000
5778           6,000
5779           5,000
5780           1,400
5781           1,100
Name: production_budget, Length: 5782, dtype: object

In [10]:
cleaned_budget_2 = cleaned_budget.map(lambda x: x.replace(',',''))
cleaned_budget_2

0        425000000
1        410600000
2        350000000
3        330600000
4        317000000
           ...
5777          7000
5778          6000
5779          5000
5780          1400
5781          1100
Name: production_budget, Length: 5782, dtype: object

In [105]:
cleaned_budget_3 = cleaned_budget_2.astype(float)
cleaned_budget_3

0      425,000,000.0
1      410,600,000.0
2      350,000,000.0
3      330,600,000.0
4      317,000,000.0
            ...
5777         7,000.0
5778         6,000.0
5779         5,000.0
5780         1,400.0
5781         1,100.0
Name: production_budget, Length: 5782, dtype: float64

In [12]:
cleaned_domestic= table9['domestic_gross'].map(lambda x: x.replace('$',' '))

cleaned_domestic

0        760,507,625
1        241,063,875
2         42,762,350
3        459,005,868
4        620,181,382
            ...
5777               0
5778          48,482
5779           1,338
5780               0
5781         181,041
Name: domestic_gross, Length: 5782, dtype: object

In [13]:
cleaned_domestic_2 =cleaned_domestic.map(lambda x: x.replace(',',''))
cleaned_domestic_2

0        760507625
1        241063875
2         42762350
3        459005868
4        620181382
           ...
5777             0
5778         48482
5779          1338
5780             0
5781        181041
Name: domestic_gross, Length: 5782, dtype: object

In [104]:
cleaned_domestic_3 = cleaned_domestic_2.astype(float)
cleaned_domestic_3

0      760,507,625.0
1      241,063,875.0
2       42,762,350.0
3      459,005,868.0
4      620,181,382.0
            ...
5777             0.0
5778        48,482.0
5779         1,338.0
5780             0.0
5781       181,041.0
Name: domestic_gross, Length: 5782, dtype: float64

In [15]:
cleaned_worldwide = table9['worldwide_gross'].map(lambda x: x.replace('$',' '))
cleaned_worldwide

0        2,776,345,279
1        1,045,663,875
2          149,762,350
3        1,403,013,963
4        1,316,721,747
             ...
5777                 0
5778           240,495
5779             1,338
5780                 0
5781           181,041
Name: worldwide_gross, Length: 5782, dtype: object

In [16]:
cleaned_worldwide_2 = cleaned_worldwide.map(lambda x: x.replace(',',''))
cleaned_worldwide_2

0        2776345279
1        1045663875
2         149762350
3        1403013963
4        1316721747
           ...
5777              0
5778         240495
5779           1338
5780              0
5781         181041
Name: worldwide_gross, Length: 5782, dtype: object

In [103]:
cleaned_worldwide_3 = cleaned_worldwide_2.astype(float)
cleaned_worldwide_3

0      2,776,345,279.0
1      1,045,663,875.0
2        149,762,350.0
3      1,403,013,963.0
4      1,316,721,747.0
             ...
5777               0.0
5778         240,495.0
5779           1,338.0
5780               0.0
5781         181,041.0
Name: worldwide_gross, Length: 5782, dtype: float64

In [106]:
table9["production_budget"] = cleaned_budget_3
table9["domestic_gross"] = cleaned_domestic_3
table9["worldwide_gross"] = cleaned_worldwide_3
table9

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,total_profit
0,1,2009-12-18,Avatar,"425,000,000.0","760,507,625.0","2,776,345,279.0",2009,2351345279
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,"410,600,000.0","241,063,875.0","1,045,663,875.0",2011,635063875
2,3,2019-06-07,Dark Phoenix,"350,000,000.0","42,762,350.0","149,762,350.0",2019,-200237650
3,4,2015-05-01,Avengers: Age of Ultron,"330,600,000.0","459,005,868.0","1,403,013,963.0",2015,1072413963
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,"317,000,000.0","620,181,382.0","1,316,721,747.0",2017,999721747
...,...,...,...,...,...,...,...,...
5777,78,2018-12-31,Red 11,"7,000.0",0.0,0.0,2018,-7000
5778,79,1999-04-02,Following,"6,000.0","48,482.0","240,495.0",1999,234495
5779,80,2005-07-13,Return to the Land of Wonders,"5,000.0","1,338.0","1,338.0",2005,-3662
5780,81,2015-09-29,A Plague So Pleasant,"1,400.0",0.0,0.0,2015,-1400
5781,82,2005-08-05,My Date With Drew,"1,100.0","181,041.0","181,041.0",2005,179941

In [30]:
table9.drop(["New_Column"], axis=1, inplace=True)

In [107]:
table9

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,total_profit
0,1,2009-12-18,Avatar,"425,000,000.0","760,507,625.0","2,776,345,279.0",2009,2351345279
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,"410,600,000.0","241,063,875.0","1,045,663,875.0",2011,635063875
2,3,2019-06-07,Dark Phoenix,"350,000,000.0","42,762,350.0","149,762,350.0",2019,-200237650
3,4,2015-05-01,Avengers: Age of Ultron,"330,600,000.0","459,005,868.0","1,403,013,963.0",2015,1072413963
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,"317,000,000.0","620,181,382.0","1,316,721,747.0",2017,999721747
...,...,...,...,...,...,...,...,...
5777,78,2018-12-31,Red 11,"7,000.0",0.0,0.0,2018,-7000
5778,79,1999-04-02,Following,"6,000.0","48,482.0","240,495.0",1999,234495
5779,80,2005-07-13,Return to the Land of Wonders,"5,000.0","1,338.0","1,338.0",2005,-3662
5780,81,2015-09-29,A Plague So Pleasant,"1,400.0",0.0,0.0,2015,-1400
5781,82,2005-08-05,My Date With Drew,"1,100.0","181,041.0","181,041.0",2005,179941

In [32]:
table9.sort_values(by='worldwide_gross', ascending=False)
#After all that work, I finally have the data sorted the way that I wanted.

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279
42,43,"Dec 19, 1997",Titanic,200000000,659363944,2208208395
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220
6,7,"Apr 27, 2018",Avengers: Infinity War,300000000,678815482,2048134200
33,34,"Jun 12, 2015",Jurassic World,215000000,652270625,1648854864
...,...,...,...,...,...,...
5474,75,"Dec 31, 2005",Insomnia Manica,500000,0,0
5473,74,"Jul 17, 2012",Girls Gone Dead,500000,0,0
5472,73,"Apr 3, 2012",Enter Nowhere,500000,0,0
5471,72,"Dec 31, 2010",Drones,500000,0,0
4068,69,"Dec 12, 2008",The Kings of Appletown,7000000,0,0

In [33]:
#converting release_date to datetime format.
cleaned_release_date = pd.to_datetime(table9['release_date'])
cleaned_release_date

0      2009-12-18
1      2011-05-20
2      2019-06-07
3      2015-05-01
4      2017-12-15
          ...
5777   2018-12-31
5778   1999-04-02
5779   2005-07-13
5780   2015-09-29
5781   2005-08-05
Name: release_date, Length: 5782, dtype: datetime64[ns]

In [108]:
table9['release_date']= cleaned_release_date
table9

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,total_profit
0,1,2009-12-18,Avatar,"425,000,000.0","760,507,625.0","2,776,345,279.0",2009,2351345279
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,"410,600,000.0","241,063,875.0","1,045,663,875.0",2011,635063875
2,3,2019-06-07,Dark Phoenix,"350,000,000.0","42,762,350.0","149,762,350.0",2019,-200237650
3,4,2015-05-01,Avengers: Age of Ultron,"330,600,000.0","459,005,868.0","1,403,013,963.0",2015,1072413963
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,"317,000,000.0","620,181,382.0","1,316,721,747.0",2017,999721747
...,...,...,...,...,...,...,...,...
5777,78,2018-12-31,Red 11,"7,000.0",0.0,0.0,2018,-7000
5778,79,1999-04-02,Following,"6,000.0","48,482.0","240,495.0",1999,234495
5779,80,2005-07-13,Return to the Land of Wonders,"5,000.0","1,338.0","1,338.0",2005,-3662
5780,81,2015-09-29,A Plague So Pleasant,"1,400.0",0.0,0.0,2015,-1400
5781,82,2005-08-05,My Date With Drew,"1,100.0","181,041.0","181,041.0",2005,179941

In [39]:
#what is the range of release dates in this data set?
print("This is the earliest release date:")
print(table9['release_date'].min())

print("This is the latest release date:")
print(table9['release_date'].max())

This is the earliest release date:
1915-02-08 00:00:00
This is the latest release date:
2020-12-31 00:00:00

In [42]:
#there are several movies that have budget information, but no gross. Presumably, this is because they hadn't
#been released at the time that this data was collected. 
table9.sort_values(by='release_date', ascending=False)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
194,95,2020-12-31,Moonfall,150000000,0,0
1205,6,2020-12-31,Hannibal the Conqueror,50000000,0,0
535,36,2020-02-21,Call of the Wild,82000000,0,0
480,81,2019-12-31,Army of the Dead,90000000,0,0
3515,16,2019-12-31,Eli,11000000,0,0
...,...,...,...,...,...,...
5606,7,1925-11-19,The Big Parade,245000,11000000,22000000
5683,84,1920-09-17,Over the Hill to the Poorhouse,100000,3000000,3000000
5614,15,1916-12-24,"20,000 Leagues Under the Sea",200000,8000000,8000000
5523,24,1916-09-05,Intolerance,385907,0,0
5677,78,1915-02-08,The Birth of a Nation,110000,10000000,11000000

In [54]:
year_of_release = table9['release_date']
year_of_release

0      2009-12-18
1      2011-05-20
2      2019-06-07
3      2015-05-01
4      2017-12-15
          ...
5777   2018-12-31
5778   1999-04-02
5779   2005-07-13
5780   2015-09-29
5781   2005-08-05
Name: release_date, Length: 5782, dtype: datetime64[ns]

In [59]:
year_of_release = pd.DatetimeIndex(table9['release_date']).year
year_of_release

Int64Index([2009, 2011, 2019, 2015, 2017, 2015, 2018, 2007, 2017, 2015,
            ...
            2012, 1993, 2004, 2006, 2004, 2018, 1999, 2005, 2015, 2005],
           dtype='int64', name='release_date', length=5782)

In [64]:
#created a column 'release_year' to more easily search general release dates, etc.
table9['release_year'] = table9['release_date'].dt.year

In [65]:
table9

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year
0,1,2009-12-18,Avatar,425000000,760507625,2776345279,2009
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011
2,3,2019-06-07,Dark Phoenix,350000000,42762350,149762350,2019
3,4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,2017
...,...,...,...,...,...,...,...
5777,78,2018-12-31,Red 11,7000,0,0,2018
5778,79,1999-04-02,Following,6000,48482,240495,1999
5779,80,2005-07-13,Return to the Land of Wonders,5000,1338,1338,2005
5780,81,2015-09-29,A Plague So Pleasant,1400,0,0,2015
5781,82,2005-08-05,My Date With Drew,1100,181041,181041,2005

In [82]:
table9['release_year'].value_counts()

2015    338
2010    274
2008    264
2006    260
2014    255
       ...
1947      1
1927      1
1941      1
1937      1
1915      1
Name: release_year, Length: 96, dtype: int64

In [96]:
#use this to change the amount of rows displayed
pd.set_option('display.max_rows', 100)

In [85]:
#let's sort by release year
table9.sort_values(by='release_year', ascending=False)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year
194,95,2020-12-31,Moonfall,150000000,0,0,2020
535,36,2020-02-21,Call of the Wild,82000000,0,0,2020
1205,6,2020-12-31,Hannibal the Conqueror,50000000,0,0,2020
2029,30,2019-09-30,Unhinged,29000000,0,0,2019
670,71,2019-08-30,PLAYMOBIL,75000000,0,0,2019
...,...,...,...,...,...,...,...
5606,7,1925-11-19,The Big Parade,245000,11000000,22000000,1925
5683,84,1920-09-17,Over the Hill to the Poorhouse,100000,3000000,3000000,1920
5614,15,1916-12-24,"20,000 Leagues Under the Sea",200000,8000000,8000000,1916
5523,24,1916-09-05,Intolerance,385907,0,0,1916
5677,78,1915-02-08,The Birth of a Nation,110000,10000000,11000000,1915

In [87]:
table9.sort_values(by='worldwide_gross', ascending=False)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year
0,1,2009-12-18,Avatar,425000000,760507625,2776345279,2009
42,43,1997-12-19,Titanic,200000000,659363944,2208208395,1997
5,6,2015-12-18,Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,2015
6,7,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,2018
33,34,2015-06-12,Jurassic World,215000000,652270625,1648854864,2015
...,...,...,...,...,...,...,...
5474,75,2005-12-31,Insomnia Manica,500000,0,0,2005
5473,74,2012-07-17,Girls Gone Dead,500000,0,0,2012
5472,73,2012-04-03,Enter Nowhere,500000,0,0,2012
5471,72,2010-12-31,Drones,500000,0,0,2010
4068,69,2008-12-12,The Kings of Appletown,7000000,0,0,2008

In [45]:
unreleased_movies = []

for movie in table9:
    if movie['worldwide_gross'] == 0:
        unreleased_movies.append(movie)

unreleased_movies

TypeError: string indices must be integers

In [111]:
#create a column that calculates the profit for each movie. (gross - budget)
#realize that there are other costs above and beyond the budget

total_profit = table9.apply(lambda x: x['worldwide_gross'] - x['production_budget'], axis=1)
total_profit

0      2,351,345,279.0
1        635,063,875.0
2       -200,237,650.0
3      1,072,413,963.0
4        999,721,747.0
             ...
5777          -7,000.0
5778         234,495.0
5779          -3,662.0
5780          -1,400.0
5781         179,941.0
Length: 5782, dtype: float64

In [112]:
table9['total_profit'] = total_profit

In [116]:
table9.sort_values(by='total_profit', ascending=False).head(100)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,total_profit
0,1,2009-12-18,Avatar,"425,000,000.0","760,507,625.0","2,776,345,279.0",2009,"2,351,345,279.0"
42,43,1997-12-19,Titanic,"200,000,000.0","659,363,944.0","2,208,208,395.0",1997,"2,008,208,395.0"
6,7,2018-04-27,Avengers: Infinity War,"300,000,000.0","678,815,482.0","2,048,134,200.0",2018,"1,748,134,200.0"
5,6,2015-12-18,Star Wars Ep. VII: The Force Awakens,"306,000,000.0","936,662,225.0","2,053,311,220.0",2015,"1,747,311,220.0"
33,34,2015-06-12,Jurassic World,"215,000,000.0","652,270,625.0","1,648,854,864.0",2015,"1,433,854,864.0"
66,67,2015-04-03,Furious 7,"190,000,000.0","353,007,020.0","1,518,722,794.0",2015,"1,328,722,794.0"
26,27,2012-05-04,The Avengers,"225,000,000.0","623,279,547.0","1,517,935,897.0",2012,"1,292,935,897.0"
260,61,2011-07-15,Harry Potter and the Deathly Hallows: Part II,"125,000,000.0","381,193,157.0","1,341,693,157.0",2011,"1,216,693,157.0"
41,42,2018-02-16,Black Panther,"200,000,000.0","700,059,566.0","1,348,258,224.0",2018,"1,148,258,224.0"
112,13,2018-06-22,Jurassic World: Fallen Kingdom,"170,000,000.0","417,719,760.0","1,305,772,799.0",2018,"1,135,772,799.0"
155,56,2013-11-22,Frozen,"150,000,000.0","400,738,009.0","1,272,469,910.0",2013,"1,122,469,910.0"
134,35,2017-03-17,Beauty and the Beast,"160,000,000.0","504,014,165.0","1,259,199,706.0",2017,"1,099,199,706.0"
672,73,2015-07-10,Minions,"74,000,000.0","336,045,770.0","1,160,336,173.0",2015,"1,086,336,173.0"
3,4,2015-05-01,Avengers: Age of Ultron,"330,600,000.0","459,005,868.0","1,403,013,963.0",2015,"1,072,413,963.0"
425,26,2003-12-17,The Lord of the Rings: The Return of the King,"94,000,000.0","377,845,905.0","1,141,403,341.0",2003,"1,047,403,341.0"
43,44,2018-06-15,Incredibles 2,"200,000,000.0","608,581,744.0","1,242,520,711.0",2018,"1,042,520,711.0"
47,48,2013-05-03,Iron Man 3,"200,000,000.0","408,992,272.0","1,215,392,272.0",2013,"1,015,392,272.0"
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,"317,000,000.0","620,181,382.0","1,316,721,747.0",2017,"999,721,747.0"
135,36,2018-12-21,Aquaman,"160,000,000.0","335,061,807.0","1,146,894,640.0",2018,"986,894,640.0"
22,23,2017-04-14,The Fate of the Furious,"250,000,000.0","225,764,765.0","1,234,846,267.0",2017,"984,846,267.0"
824,25,1993-06-11,Jurassic Park,"63,000,000.0","395,708,305.0","1,038,812,584.0",1993,"975,812,584.0"
629,30,2017-06-30,Despicable Me 3,"75,000,000.0","264,624,300.0","1,034,727,750.0",2017,"959,727,750.0"
95,96,2019-03-08,Captain Marvel,"175,000,000.0","426,525,952.0","1,123,061,550.0",2019,"948,061,550.0"
63,64,2011-06-29,Transformers: Dark of the Moon,"195,000,000.0","352,390,543.0","1,123,790,543.0",2011,"928,790,543.0"
303,4,1999-05-19,Star Wars Ep. I: The Phantom Menace,"115,000,000.0","474,544,677.0","1,027,044,677.0",1999,"912,044,677.0"
51,52,2012-11-08,Skyfall,"200,000,000.0","304,360,277.0","1,110,526,981.0",2012,"910,526,981.0"
608,9,1994-06-15,The Lion King,"79,300,000.0","421,785,283.0","986,214,868.0",1994,"906,914,868.0"
621,22,2013-07-03,Despicable Me 2,"76,000,000.0","368,065,385.0","975,216,835.0",2013,"899,216,835.0"
36,37,2014-06-27,Transformers: Age of Extinction,"210,000,000.0","245,439,076.0","1,104,039,076.0",2014,"894,039,076.0"
16,17,2016-05-06,Captain America: Civil War,"250,000,000.0","408,084,349.0","1,140,069,413.0",2016,"890,069,413.0"
437,38,2017-12-20,Jumanji: Welcome to the Jungle,"90,000,000.0","404,508,916.0","964,496,193.0",2017,"874,496,193.0"
156,57,2016-03-04,Zootopia,"150,000,000.0","341,268,248.0","1,019,429,616.0",2016,"869,429,616.0"
46,47,2010-06-18,Toy Story 3,"200,000,000.0","415,004,880.0","1,068,879,522.0",2010,"868,879,522.0"
692,93,2004-05-19,Shrek 2,"70,000,000.0","441,226,247.0","937,008,132.0",2004,"867,008,132.0"
262,63,2001-11-16,Harry Potter and the Sorcererâs Stone,"125,000,000.0","317,871,467.0","975,047,606.0",2001,"850,047,606.0"
44,45,2016-12-16,Rogue One: A Star Wars Story,"200,000,000.0","532,177,324.0","1,049,102,856.0",2016,"849,102,856.0"
424,25,2003-05-30,Finding Nemo,"94,000,000.0","380,529,370.0","936,429,370.0",2003,"842,429,370.0"
27,28,2006-07-07,Pirates of the Caribbean: Dead Manâs Chest,"225,000,000.0","423,315,812.0","1,066,215,812.0",2006,"841,215,812.0"
426,27,2002-12-18,The Lord of the Rings: The Two Towers,"94,000,000.0","342,548,984.0","934,699,645.0",2002,"840,699,645.0"
983,84,2018-11-02,Bohemian Rhapsody,"55,000,000.0","216,303,339.0","894,985,342.0",2018,"839,985,342.0"
263,64,2010-11-19,Harry Potter and the Deathly Hallows: Part I,"125,000,000.0","296,131,568.0","960,431,568.0",2010,"835,431,568.0"
50,51,2010-03-05,Alice in Wonderland,"200,000,000.0","334,191,110.0","1,025,491,110.0",2010,"825,491,110.0"
45,46,2016-06-17,Finding Dory,"200,000,000.0","486,295,561.0","1,021,215,193.0",2016,"821,215,193.0"
74,75,2008-07-18,The Dark Knight,"185,000,000.0","533,720,947.0","1,001,996,207.0",2008,"816,996,207.0"
625,26,2016-07-08,The Secret Life of Pets,"75,000,000.0","368,384,330.0","886,750,534.0",2016,"811,750,534.0"
10,11,2012-07-20,The Dark Knight Rises,"275,000,000.0","448,139,099.0","1,084,439,099.0",2012,"809,439,099.0"
157,58,2007-07-11,Harry Potter and the Order of the Phoenix,"150,000,000.0","292,137,260.0","943,076,457.0",2007,"793,076,457.0"
96,97,2016-04-15,The Jungle Book,"175,000,000.0","364,001,123.0","962,854,547.0",2016,"787,854,547.0"
413,14,2012-07-13,Ice Age: Continental Drift,"95,000,000.0","161,321,843.0","879,765,137.0",2012,"784,765,137.0"
3525,26,1982-06-11,ET: The Extra-Terrestrial,"10,500,000.0","435,110,554.0","792,965,326.0",1982,"782,465,326.0"
363,64,2002-11-15,Harry Potter and the Chamber of Secrets,"100,000,000.0","262,233,381.0","879,225,135.0",2002,"779,225,135.0"
342,43,2001-12-19,The Lord of the Rings: The Fellowship of the Ring,"109,000,000.0","315,544,750.0","887,210,985.0",2001,"778,210,985.0"
3464,65,1977-05-25,Star Wars Ep. IV: A New Hope,"11,000,000.0","460,998,007.0","786,598,007.0",1977,"775,598,007.0"
442,43,2009-07-01,Ice Age: Dawn of the Dinosaurs,"90,000,000.0","196,573,705.0","859,701,857.0",2009,"769,701,857.0"
18,19,2012-12-14,The Hobbit: An Unexpected Journey,"250,000,000.0","303,003,568.0","1,017,003,568.0",2012,"767,003,568.0"
158,59,2005-11-18,Harry Potter and the Goblet of Fire,"150,000,000.0","290,201,752.0","897,099,794.0",2005,"747,099,794.0"
955,56,2016-02-12,Deadpool,"58,000,000.0","363,070,709.0","801,025,593.0",2016,"743,025,593.0"
626,27,1996-07-02,Independence Day,"75,000,000.0","306,169,255.0","817,400,878.0",1996,"742,400,878.0"
302,3,2018-10-05,Venom,"116,000,000.0","213,511,408.0","853,628,605.0",2018,"737,628,605.0"
237,38,2013-11-22,The Hunger Games: Catching Fire,"130,000,000.0","424,668,047.0","864,868,047.0",2013,"734,868,047.0"
304,5,2005-05-19,Star Wars Ep. III: Revenge of the Sith,"115,000,000.0","380,270,577.0","848,998,877.0",2005,"733,998,877.0"
20,21,2013-12-13,The Hobbit: The Desolation of Smaug,"250,000,000.0","258,366,855.0","960,366,855.0",2013,"710,366,855.0"
98,99,2017-07-07,Spider-Man: Homecoming,"175,000,000.0","334,201,140.0","880,166,350.0",2017,"705,166,350.0"
21,22,2014-12-17,The Hobbit: The Battle of the Five Armies,"250,000,000.0","255,119,788.0","945,577,621.0",2014,"695,577,621.0"
224,25,2012-11-16,"The Twilight Saga: Breaking Dawn, Part 2","136,200,000.0","292,324,737.0","829,724,737.0",2012,"693,524,737.0"
19,20,2009-07-15,Harry Potter and the Half-Blood Prince,"250,000,000.0","302,089,278.0","935,213,767.0",2009,"685,213,767.0"
218,19,2002-05-03,Spider-Man,"139,000,000.0","403,706,375.0","821,706,375.0",2002,"682,706,375.0"
97,98,2015-06-19,Inside Out,"175,000,000.0","356,461,711.0","854,235,992.0",2015,"679,235,992.0"
314,15,2018-05-18,Deadpool 2,"110,000,000.0","324,591,735.0","786,680,557.0",2018,"676,680,557.0"
137,38,2010-07-16,Inception,"160,000,000.0","292,576,195.0","835,524,642.0",2010,"675,524,642.0"
154,55,2017-06-02,Wonder Woman,"150,000,000.0","412,563,408.0","821,133,378.0",2017,"671,133,378.0"
81,82,2017-11-03,Thor: Ragnarok,"180,000,000.0","315,058,289.0","846,980,024.0",2017,"666,980,024.0"
238,39,2004-06-04,Harry Potter and the Prisoner of Azkaban,"130,000,000.0","249,757,726.0","796,907,323.0",2004,"666,907,323.0"
7,8,2007-05-24,Pirates of the Caribbean: At Worldâs End,"300,000,000.0","309,420,425.0","963,420,425.0",2007,"663,420,425.0"
1623,24,2017-09-08,It,"35,000,000.0","327,481,748.0","697,457,969.0",2017,"662,457,969.0"
48,49,2017-05-05,Guardians of the Galaxy Vol 2,"200,000,000.0","389,813,101.0","862,316,233.0",2017,"662,316,233.0"
136,37,2007-05-17,Shrek the Third,"160,000,000.0","322,719,944.0","807,330,936.0",2007,"647,330,936.0"
264,65,2006-05-19,The Da Vinci Code,"125,000,000.0","217,536,138.0","767,820,459.0",2006,"642,820,459.0"
261,62,2014-11-21,The Hunger Games: Mockingjay - Part 1,"125,000,000.0","337,135,885.0","766,575,131.0",2014,"641,575,131.0"
752,53,2010-06-30,The Twilight Saga: Eclipse,"68,000,000.0","300,531,751.0","706,102,828.0",2010,"638,102,828.0"
1081,82,2009-11-20,The Twilight Saga: New Moon,"50,000,000.0","296,623,634.0","687,557,727.0",2009,"637,557,727.0"
15,16,2007-05-04,Spider-Man 3,"258,000,000.0","336,530,303.0","894,860,230.0",2007,"636,860,230.0"
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,"410,600,000.0","241,063,875.0","1,045,663,875.0",2011,"635,063,875.0"
1374,75,1999-08-06,The Sixth Sense,"40,000,000.0","293,506,292.0","672,806,292.0",1999,"632,806,292.0"
139,40,2013-05-24,Fast and Furious 6,"160,000,000.0","238,679,850.0","789,300,444.0",2013,"629,300,444.0"
35,36,2009-06-24,Transformers: Revenge of the Fallen,"210,000,000.0","402,111,870.0","836,519,699.0",2009,"626,519,699.0"
981,82,1994-07-06,Forrest Gump,"55,000,000.0","330,151,138.0","679,850,637.0",1994,"624,850,637.0"
101,2,2017-11-22,Coco,"175,000,000.0","209,726,015.0","798,008,101.0",2017,"623,008,101.0"
84,85,2016-11-18,Fantastic Beasts and Where to Find Them,"180,000,000.0","234,037,575.0","802,402,853.0",2016,"622,402,853.0"
17,18,2016-03-25,Batman v Superman: Dawn of Justice,"250,000,000.0","330,360,194.0","867,500,281.0",2016,"617,500,281.0"
91,92,2018-07-27,Mission: ImpossibleâFallout,"178,000,000.0","220,159,104.0","787,456,552.0",2018,"609,456,552.0"
196,97,2012-06-08,Madagascar 3: Europe's Most Wanted,"145,000,000.0","216,391,482.0","746,921,271.0",2012,"601,921,271.0"
75,76,2008-05-22,Indiana Jones and the Kingdom of the Crystal S...,"185,000,000.0","317,101,119.0","786,635,413.0",2008,"601,635,413.0"
113,14,2014-08-01,Guardians of the Galaxy,"170,000,000.0","333,172,112.0","770,867,516.0",2014,"600,867,516.0"
537,38,2012-03-23,The Hunger Games,"80,000,000.0","408,010,692.0","677,923,379.0",2012,"597,923,379.0"
2159,60,2004-02-25,The Passion of the Christ,"25,000,000.0","370,782,930.0","622,341,924.0",2004,"597,341,924.0"
49,50,2004-06-30,Spider-Man 2,"200,000,000.0","373,524,485.0","795,110,670.0",2004,"595,110,670.0"
126,27,2010-05-21,Shrek Forever After,"165,000,000.0","238,736,787.0","756,244,673.0",2010,"591,244,673.0"
159,60,2003-05-15,The Matrix Reloaded,"150,000,000.0","281,553,689.0","738,576,929.0",2003,"588,576,929.0"
2485,86,1991-11-13,Beauty and the Beast,"20,000,000.0","376,057,266.0","608,431,132.0",1991,"588,431,132.0"

In [117]:
#What is the return on investment for these movies?
roi = table9.apply(lambda x: x['total_profit'] / x['production_budget'], axis=1)
roi

0        5.532577127058824
1       1.5466728567949342
2      -0.5721075714285714
3       3.2438413883847548
4       3.1536963627760253
               ...
5777                  -1.0
5778               39.0825
5779               -0.7324
5780                  -1.0
5781    163.58272727272728
Length: 5782, dtype: float64

In [119]:
table9['ROI'] = roi
table9

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,total_profit,ROI
0,1,2009-12-18,Avatar,"425,000,000.0","760,507,625.0","2,776,345,279.0",2009,"2,351,345,279.0",5.532577127058824
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,"410,600,000.0","241,063,875.0","1,045,663,875.0",2011,"635,063,875.0",1.5466728567949342
2,3,2019-06-07,Dark Phoenix,"350,000,000.0","42,762,350.0","149,762,350.0",2019,"-200,237,650.0",-0.5721075714285714
3,4,2015-05-01,Avengers: Age of Ultron,"330,600,000.0","459,005,868.0","1,403,013,963.0",2015,"1,072,413,963.0",3.2438413883847548
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,"317,000,000.0","620,181,382.0","1,316,721,747.0",2017,"999,721,747.0",3.1536963627760253
...,...,...,...,...,...,...,...,...,...
5777,78,2018-12-31,Red 11,"7,000.0",0.0,0.0,2018,"-7,000.0",-1.0
5778,79,1999-04-02,Following,"6,000.0","48,482.0","240,495.0",1999,"234,495.0",39.0825
5779,80,2005-07-13,Return to the Land of Wonders,"5,000.0","1,338.0","1,338.0",2005,"-3,662.0",-0.7324
5780,81,2015-09-29,A Plague So Pleasant,"1,400.0",0.0,0.0,2015,"-1,400.0",-1.0
5781,82,2005-08-05,My Date With Drew,"1,100.0","181,041.0","181,041.0",2005,"179,941.0",163.58272727272728

In [123]:
table9.describe()

,id,production_budget,domestic_gross,worldwide_gross,release_year,total_profit,ROI
count,"5,782.0","5,782.0","5,782.0","5,782.0","5,782.0","5,782.0","5,782.0"
mean,50.37236250432376,"31,587,757.0965064","41,873,326.867001034","91,487,460.90643376","2,003.967139398132","59,899,703.80992736",3.8001613657949647
std,28.821076273431096,"41,812,076.82694309","68,240,597.35690415","174,719,968.77890477",12.72438635224143,"146,088,881.08156952",29.530282308933067
min,1.0,"1,100.0",0.0,0.0,"1,915.0","-200,237,650.0",-1.0
25%,25.0,"5,000,000.0","1,429,534.5","4,125,414.75","2,000.0","-2,189,070.75",-0.5077043980392156
50%,50.0,"17,000,000.0","17,225,945.0","27,984,448.5","2,007.0","8,550,285.5",0.7083098257683216
75%,75.0,"40,000,000.0","52,348,661.5","97,645,836.5","2,012.0","60,968,501.75",2.7583460836038967
max,100.0,"425,000,000.0","936,662,225.0","2,776,345,279.0","2,020.0","2,351,345,279.0","1,799.0"

## Data Preparation

Describe and justify the process for preparing the data for analysis.

***
Questions to consider:
* Were there variables you dropped or created?
* How did you address missing values or outliers?
* Why are these choices appropriate given the data and the business problem?
***

In [ ]:
# Here you run your code to clean the data

## Data Modeling
Describe and justify the process for analyzing or modeling the data.

***
Questions to consider:
* How did you analyze or model the data?
* How did you iterate on your initial approach to make it better?
* Why are these choices appropriate given the data and the business problem?
***

In [ ]:
# Here you run your code to model the data

## Evaluation
Evaluate how well your work solves the stated business problem.

***
Questions to consider:
* How do you interpret the results?
* How well does your model fit your data? How much better is this than your baseline model?
* How confident are you that your results would generalize beyond the data you have?
* How confident are you that this model would benefit the business if put into use?
***

## Conclusions
Provide your conclusions about the work you've done, including any limitations or next steps.

***
Questions to consider:
* What would you recommend the business do as a result of this work?
* What are some reasons why your analysis might not fully solve the business problem?
* What else could you do in the future to improve this project?
***